/* 
  Localizable.strings
  dialog

  Created by Bart Reardon on 29/5/2022.
  
*/

// error sheet
"invalid-input" = "Un ou plusieurs champs de saisie sont incorrects";
"is-required" = "est requis";
"no-pattern" = "ne correspond pas au format requis";

// required fields text
"required-note" = "* Champs obligatoires";

//buttons
"button-cancel" = "Annuler";
"button-more-info" = "Plus d'information";
"button-ok" = "D'accord";
"button-select" = "Sélectionner";

//default text
"default-title" = "Un message important";
"default-message" = "Ceci contient un contenu de message important\n\nLisez s'il vous plaît";
"help-hover" = "Cliquez pour plus d'informations";

//constructor kit labels
"ck-welcome"            = "Bienvenue dans le générateur de SwiftDialog";
"ck-welcomeinfo"        = "Sélectionnez les propriétés à gauche pour les modifier. SwiftDialog se mettra à jour pour afficher les modifications en temps réel";
"ck-basic"              = "Basique";
"ck-content"            = "Teneur";
"ck-window"             = "La fenêtre";
"ck-sidebar"            = "Barre latérale";
"ck-dataentry"          = "Saisie des données";
"ck-buttons"            = "Boutons";
"ck-advanced"           = "Avancé";
"ck-listitems"          = "Liste des éléments";
"ck-images"             = "Images";
"ck-media"              = "Médias";
"ck-output"             = "Production";
"ck-jsonoutput"         = "Sortie JSON";
"ck-quit"               = "Quitter";
"ck-exportcommand"      = "Commande d'exportation";
"ck-title"              = "Titre";
"ck-colour"             = "Couleur";
"ck-reset"              = "Réinitialiser";
"ck-fontsize"           = "Taille de police: ";
"ck-value"              = "évaluer:";
"ck-message"            = "Message";
"ck-textalignmnet"      = "Alignement du texte";
"ck-verticalposition"   = "Position verticale";
"ck-windowheight"       = "Hauteur de la fenêtre";
"ck-heightvalue"        = "Valeur de hauteur :";
"ck-windowwidth"        = "Largeur de la fenêtre";
"ck-widthvalue"         = "Valeur de largeur :";
"ck-windowproperties"   = "Propriétés de la fenêtre";
"ck-presetsizes"        = "Tailles prédéfinies";
"ck-small"              = "Petit";
"ck-big"                = "Grand";
"ck-screenblur"         = "Flou d'arrière-plan de l'écran";
"ck-movable"            = "Mobile";
"ck-forceontop"         = "Forcer au sommet";
"ck-progressbar"        = "Barre de progression";
"ck-progressvalue"      = "Valeur de progression :";
"ck-progresstext"       = "Texte de progression :";
"ck-bannerimage"        = "Image de bannière";
"ck-select"             = "Sélectionner";
"ck-watermark"          = "Filigrane";
"ck-fill"               = "Remplir";
"ck-alpha"              = "Alpha";
"ck-scale"              = "Échelle";
"ck-position"           = "Positionner";
"ck-icon"               = "Icône";
"ck-visible"            = "Visible";
"ck-centred"            = "Centré";
"ck-select"             = "Sélectionner";
"ck-iconsize"           = "Taille de l'icône";
"ck-sizevalue"          = "Valeur de taille :";
"ck-overlay"            = "Recouvrir";
"ck-infobox"            = "Boîte d'info";
"ck-infotext"           = "Texte d'information";
"ck-infotextlabel"      = "Texte d'information";
"ck-button1"            = "Bouton1";
"ck-button2"            = "Bouton2";
"ck-infobuttonlabel"    = "Bouton Infos";
"ck-quitoninfo"         = "Quitter sur info";
"ck-label"              = "Étiquette: ";
"ck-infobuttonaction"   = "Action du bouton d'informations : ";
"ck-autoplay"           = "Lecture automatique";
"ck-autoplayseconds"    = "Lecture automatique des secondes";
"ck-path"               = "Chemin";
"ck-caption"            = "Légende";
"ck-statustext"         = "Texte d'état";
"ck-status"             = "Statut";
"ck-formatjson"         = "Formater la sortie en JSON";
"ck-textfields"         = "Champs de texte";
"ck-show"               = "Montrer";
"ck-required"           = "Obligatoire";
"ck-secure"             = "Sécurise";
"ck-prompt"             = "Rapide";
"ck-regex"              = "Regex";
"ck-regexerror"         = "Erreur d'expression régulière";
"ck-select"             = "Sélectionner";
"ck-checkbox"           = "Case à cocher";
"ck-video"              = "Vidéo";
"ck-filename"           = "Nom de fichier";
"ck-web"                = "La toile";
"ck-url"                = "URL";
"ck-disabled"           = "Désactivée";
"ck-enabled"            = "Autorisé";
